<template>
  <div id="music">
    <!-- 搜索框 -->
     <div class="search bar7">
        <div>
            <input type="text" placeholder="请输入歌名" name="crid" @keyup.enter="playMusic(songName)" v-model="songName">
            <button type="submit" id="searchMusic" @click="playMusic(songName)"></button>
        </div>
    </div>
     <!--music：当前播放的音乐。 list：播放列表 ：showlrc：是否显示歌词-->
     <aplayer :music="audio[0]" :list="audio"  :showlrc="true" ></aplayer>
  </div>
</template>

<script>
import aplayer from "vue-aplayer"; 
import {GetSong,GetPlayMisicUrl,GetPlayMisicLyric} from "@/musicNetWork/music.js"; 
  export default {
    data() {
      return {
        songName:'cmj',
     
         // 音频列表
        audio:  [
          // 默认播放列表
            {
                title:'晚婚',
                artist: '江蕙',
                url: 'https://m801.music.126.net/20220313213309/c34fefd2a5b5570ce982ff71859c5bb4/jdyyaac/0509/0252/015e/2cac2c6bf2582ca0db7d647ff56dfd0a.m4a',
                pic: "https://p1.music.126.net/HOXmTu-CY2891T_7RrG6pQ==/109951163559527770.jpg?param=130y130" ,
                lrc: '[00:00.000] 作词 : 李宗盛\n[00:01.000] 作曲 : 李宗盛\n[00:20.86]情让人伤神 爱更困身\n[00:27.94]女人真聪明 一爱就笨\n[00:34.93]往往爱一个人 有千百种可能\n[00:41.94]滋味不见得 好过长夜孤枕\n[00:49.84]我不会逃避 我会很认真\n[00:57.07]那爱来敲门 回声的确好深\n[01:03.91]我从来不想独身 却有预感晚婚\n[01:10.30]我在等 世上唯一契合灵魂\n[01:17.83]让我擦去脸上脂粉\n[01:25.09]让他听完全部传闻\n[01:31.87]将来若有人跟我争\n[01:35.74]他答应不会默不作声\n[01:39.53]他能不能 能不能\n[01:46.73]让我擦去脸上脂粉\n[01:54.10]让他听完全部传闻\n[02:00.73]再聊聊若是非得分\n[02:04.92]先相约谁都不许苦撑\n[02:08.55]他能不能 能不能\n[02:15.47]他能不能 我能不能\n[02:23.82]\n[02:38.50]我不会逃避 我会很认真\n[02:45.51]那爱来敲门 回声的确好深\n[02:52.34]我从来不想独身 却有预感晚婚\n[02:59.05]我在等 世上唯一契合灵魂\n[03:06.38]让我擦去脸上脂粉\n[03:13.63]让他听完全部传闻\n[03:20.21]再聊聊若是非得分\n[03:24.20]先相约谁都不许苦撑\n[03:28.32]他能不能 能不能\n[03:49.94]让我擦去脸上的脂粉\n[03:57.17]让他听完全部传闻\n[04:03.84]将来若有人跟我争\n[04:07.92]他答应不会默不作声\n[04:11.57]他能不能 能不能\n[04:18.87]让我擦去脸上脂粉\n[04:26.04]让他听完全部传闻\n[04:32.67]再聊聊若是非得分\n[04:36.86]先相约谁都不许苦撑\n[04:40.64]他能不能 能不能\n[04:47.76]他能不能 我能不能\n[04:55.25]他能不能 我能不能\n[05:02.94]他能不能 我又能不能\n',
            },
            {
                title:'百年孤寂',
                artist: '苏玮',
                url: 'https://m701.music.126.net/20220313213858/8c821ec4c7e428ea66bea07e587e824c/jdyyaac/obj/w5rDlsOJwrLDjj7CmsOj/11215423242/3860/31ee/a1e9/56dddd21a7e2e5bc65b9171414ddc986.m4a',
                pic: "https://p1.music.126.net/vGsVzlfFMHl4iGy8hfsCyQ==/109951166512617210.jpg?param=130y130" ,
                lrc: "[00:00.000] 作词 : 林夕\n[00:00.614] 作曲 : C. Y. Kong/Adrian Chan\n[00:01.228] 原唱 : 王菲\n[00:01.842]出品：网易音乐人 X 青云LAB\n[00:02.443]本歌曲已获原版权公司正规授权\n[00:12.526]\n[00:31.465]心属于你的 我借来寄托\n[00:38.387]却变成我的心魔\n[00:44.474]你属于谁的 我刚好经过\n[00:51.161]却带来潮起潮落\n[00:55.759]\n[00:56.412]都是因为 一路上 一路上\n[01:00.200]大雨曾经滂沱 证明你有来过\n[01:09.212]可是当我闭上眼 再睁开眼\n[01:13.522]只看见沙漠 哪里有什么骆驼\n[01:21.777]\n[01:22.874]背影是真的 人是假的 没什么执着\n[01:29.065]一百年前 你不是你 我不是我\n[01:35.622]悲哀是真的 泪是假的 本来没因果\n[01:41.943]一百年后 没有你 也没有我\n[01:48.970]\n[02:20.422]风属于天的 我借来吹吹\n[02:27.161]却吹起人间烟火\n[02:33.222]天属于谁的 我借来欣赏\n[02:40.013]却看到你的轮廓\n[02:44.559]\n[02:45.238]都是因为 一路上 一路上\n[02:49.026]大雨曾经滂沱 证明你有来过\n[02:58.012]可是当我闭上眼 再睁开眼\n[03:02.270]只看见沙漠 哪里有什么骆驼\n[03:10.681]\n[03:11.648]背影是真的 人是假的 没什么执着\n[03:17.996]一百年前 你不是你 我不是我\n[03:24.422]悲哀是真的 泪是假的 本来没因果\n[03:30.769]一百年后 没有你 也没有我\n[03:40.513]\n[03:51.693]背影是真的 人是假的 没什么执着\n[03:58.093]一百年前 你不是你 我不是我\n[04:04.441]悲哀是真的 泪是假的 本来没因果\n[04:10.789]一百年后 没有你 也没有我\n[04:16.771]\n[04:18.939]背影是真的 人是假的 没什么执着\n[04:25.209]一百年前 你不是你 我不是我\n[04:31.609]悲哀是真的 泪是假的 本来没因果\n[04:38.139]一百年后 没有你 也没有我\n[04:43.703]\n[04:45.480]编曲：王景\n[04:45.819]吉他：大牛\n[04:46.211]弦乐：国际首席爱乐乐团\n[04:46.498]弦乐监制：李朋\n[04:46.812]录音：姜姜\n[04:47.125]和声：王韩伊淋\n[04:47.439]混音：长渊\n[04:48.118]特别鸣谢：刘音辉@響livehouse\n[04:48.431]OP：EMI MUSIC PUBLISHING ASIA/PASSPORT PUBLISHING\n[04:48.771]SP: 百代音乐版权代理（北京）有限公司\n[04:49.111]OP：Faye Productions Ltd (Warner Chappell Music, Hong Kong Limited)\n[04:49.450]SP：Warner Chappell Music Publishing Agency (Beijing) Ltd.\n"


            },
            {
                title:'孤勇者',
                artist: '陈奕迅',
                url: 'https://m701.music.126.net/20220313214251/ce1b58f7d3595a95edb5f94d4a797f2c/jdyyaac/obj/w5rDlsOJwrLDjj7CmsOj/11983357028/fa35/71e6/ecfb/e58acc011ea31f62f8aad4bb0ce96846.m4a',
                pic: "https://p2.music.126.net/aG5zqxkBRfLiV7A8W0iwgA==/109951166702962263.jpg?param=130y130" ,
                lrc: "[00:00.000] 作词 : 唐恬\n[00:00.288] 作曲 : 钱雷\n[00:00.576] 编曲 : 钱雷\n[00:00.864] 吉他：高飞\n[00:01.152] 人声录音师：利伟明\n[00:01.440] 人声录音棚：雅旺录音室\n[00:01.728] Vocal edite：汝文博@SBMS Beijing\n[00:02.016] 混音&母带：周天澈@Studio 21A\n[00:02.304] 词版权管理方：北京梦织音传媒有限公司 \n[00:02.592] 曲版权管理方：索尼音乐版权代理（北京）有限公司         \n[00:02.880] 录音作品及MV版权：EAS MUSIC LTD\n[00:03.168] 联合出品：拳头游戏/腾讯游戏/腾讯视频\n[00:03.456] 联合出品监制：霍锦 卢泓宇\n[00:03.744] 制作人：钱雷\n[00:04.33]Vocal edite：汝文博@SBMS Beijing\n[00:04.49]混音&母带：周天澈@Studio 21A\n[00:04.63]词版权管理方：北京梦织音传媒有限公司\n[00:04.78]曲版权管理方：索尼音乐版权代理（北京）有限公司\n[00:04.92]录音作品及MV版权：EAS MUSIC LTD\n[00:05.07]出品监制：霍锦 卢泓宇\n[00:22.29]都 是勇敢的\n[00:28.50]你额头的伤口 你的 不同 你犯的错\n[00:36.96]都 不必隐藏\n[00:43.20]你破旧的玩偶 你的 面具 你的自我\n[00:51.46]\n[00:51.76]他们说 要带着光 驯服每一头怪兽\n[00:58.65]他们说 要缝好你的伤 没有人爱小丑\n[01:05.98]为何孤独 不可 光荣\n[01:09.25]人只有不完美 值得歌颂\n[01:13.52]谁说污泥满身的不算英雄\n[01:20.50]\n[01:20.80]爱你孤身走暗巷\n[01:22.88]爱你不跪的模样\n[01:24.61]爱你对峙过绝望\n[01:26.41]不肯哭一场\n[01:28.05]\n[01:28.35]爱你破烂的衣裳\n[01:30.11]却敢堵命运的枪\n[01:31.95]爱你和我那么像\n[01:33.83]缺口都一样\n[01:35.23]\n[01:35.53]去吗？配吗？这褴褛的披风\n[01:39.43]战吗？战啊！以最卑微的梦\n[01:43.08]致那黑夜中的呜咽与怒吼\n[01:50.35]谁说站在光里的才算英雄\n[02:08.41]\n[02:08.71]他们说 要戒了你的狂 就像擦掉了污垢\n[02:16.25]他们说 要顺台阶而上 而代价是低头\n[02:23.33]那就让我 不可 乘风\n[02:26.59]你一样骄傲着 那种孤勇\n[02:31.07]谁说对弈平凡的不算英雄\n[02:38.05]\n[02:38.35]爱你孤身走暗巷\n[02:40.29]爱你不跪的模样\n[02:42.10]爱你对峙过绝望\n[02:43.85]不肯哭一场\n[02:45.92]\n[02:45.92]爱你破烂的衣裳\n[02:47.62]却敢堵命运的枪\n[02:49.43]爱你和我那么像\n[02:51.37]缺口都一样\n[02:52.86]\n[02:53.16]去吗？配吗？这褴褛的披风\n[02:56.85]战吗？战啊！以最卑微的梦\n[03:00.55]致那黑夜中的呜咽与怒吼\n[03:07.82]谁说站在光里的才算英雄\n[03:12.25]\n[03:12.55]你的斑驳 与众不同\n[03:19.89]你的沉默 震耳欲聋 You Are The Hero\n[03:26.14]\n[03:26.44]爱你孤身走暗巷\n[03:28.27]爱你不跪的模样\n[03:30.09]爱你对峙过绝望\n[03:31.94]不肯哭一场 (You Are The Hero)\n[03:33.45]\n[03:33.75]爱你来自于蛮荒\n[03:35.75]一生不借谁的光\n[03:37.43]你将造你的城邦\n[03:39.25]在废墟之上\n[03:40.72]\n[03:41.02]去吗？去啊！以最卑微的梦\n[03:44.85]战吗？战啊！以最孤高的梦\n[03:48.54]致那黑夜中的呜咽与怒吼\n[03:55.81]谁说站在光里的才算英雄\n"

            },
            {
                title:'匿名的好友',
                artist: '小包Zerinn',
                url: 'https://rt01-sycdn.kuwo.cn/7b5137bac33d558e774c26a95ed38bf4/6077019a/resource/n1/18/25/1394031454.mp3',
                pic: "http://p4.music.126.net/M34HFzLO2xhDLuX_zEALKA==/109951164291347934.jpg?param=100y100" ,
                lrc: "[00:00.000] 作词 : 李焯雄\n[00:00.400] 作曲 : 陈颖见\n[00:00.800] 原唱 : 杨丞琳\n[00:01.200] 编曲 : 百川Rebellious\n[00:01.600] 制作人 : 百川Rebellious\n[00:02.00]不能握的手 从此匿名的朋友\n[00:08.22]其实我的执着依然执着\n[00:12.03]与你无关泪自行吸收\n[00:16.02]\n[00:18.08]杜松混合茉莉的风 回忆里被爱\n[00:23.95]那股悸动 天色好红\n[00:27.91]温柔好浓 在胸口浮现你的面容\n[00:32.65]一起活在这城市迷宫 提起你名字\n[00:38.70]心还跳动 却没重逢\n[00:42.63]只有想碰却又不敢碰的那种悸动\n[00:47.28]也许我们当时年纪真的太小\n[00:51.03]从那懵懵懂懂 走进各自天空\n[00:54.70]该怎么说让彼此选择 但思念还转动\n[01:03.23]\n[01:04.24]不能握的手 从此匿名的朋友\n[01:10.90]其实我的执着依然执着\n[01:15.06]与你无关泪自行吸收\n[01:18.83]不能握的手 却比亲人更亲厚\n[01:27.04]但所有如果都没有如果\n[01:31.37]只有失去的温柔 最温柔\n[01:38.78]\n[01:50.23]当又一次美梦落空 回忆里被爱\n[01:56.10]那股悸动 天色好红\n[02:00.08]温柔好浓 在胸口浮现你的脸容\n[02:05.01]也许我们当时年纪真的太小\n[02:08.60]从那懵懵懂懂走进各自天空\n[02:12.26]那是什么 让彼此选择 又不仅是尊重\n[02:20.88]\n[02:21.61]不能握的手 从此匿名的朋友\n[02:28.28]其实我的执着依然执着\n[02:32.52]与你无关泪自行吸收\n[02:36.17]不能握的手 却比亲人更亲厚\n[02:42.76]但所有如果都没有如果\n[02:47.20]只有失去的温柔 最温柔\n[02:55.42]\n[02:58.656] 混音 : 百川Rebellious\n[03:02.270] 吉他 : 刘夏飞\n[03:05.884] 和声编写/演唱 : 百川Rebellious\n[03:09.498] 录音棚 : bfs黑旗录音室\n[03:13.112] 监制 : 林达浪\n[03:16.726] 统筹 : 初初\n"

            },
            {
                title:' Letting go',
                artist: '陈老夕',
                url: 'https://m801.music.126.net/20220313223128/77ae1f59b14cb34fbad662d47c4e481a/jdyyaac/obj/w5rDlsOJwrLDjj7CmsOj/13167004642/6c6c/add3/462a/ae663730d821721aee7db35adf6a15da.m4a',
                pic: "https://p1.music.126.net/eo9_AxfxdR0D-ZLhvOEF1Q==/109951163766465119.jpg?param=130y130" ,
                lrc: "[00:00.000] 作词 : 蔡健雅\n[00:01.000] 作曲 : 蔡健雅\n[00:04.195]原唱：蔡健雅\n[00:11.202]翻唱：陈老兮\n[00:12.202]出品：网易音乐人 X 青云LAB\n[00:13.202]本作品经过词曲著作权利方授权\n[00:14.695]这是一封离别信\n[00:18.451]写下我该离开的原因\n[00:21.950]在我生命中扮演的角色\n[00:27.198]太模糊了\n[00:29.703]你对我常忽冷忽热\n[00:33.198]我到底是情人还是朋友\n[00:36.707]爱你是否不该太认真\n[00:40.695]that's why\n[00:42.952]I'm letting go\n[00:45.699]我终于舍得为你放开手\n[00:49.454]因为爱你爱到我心痛\n[00:54.705]但你却不懂\n[00:56.948]I'm letting go\n[00:59.704]你对一切都软弱与怠惰\n[01:03.700]让人怀疑你是否爱过我\n[01:08.700]真的爱过我\n[01:12.705]为你再也找不到借口\n[01:15.954]that’s when we should let it go\n[01:32.698]你是呼吸的空气\n[01:36.703]脱离不了的地心引力\n[01:40.450]在我生命中曾经是我 存在的原因\n[01:47.458]或许就像他们说\n[01:50.700]爱情只会让人变愚蠢\n[01:54.450]自作多情爱地太天真\n[01:58.203]that's why\n[02:00.705]I'm letting go\n[02:03.450]我终于舍得为你放开手\n[02:07.196]因为爱你爱到我心痛\n[02:12.199]但你却不懂\n[02:14.951]I'm letting go\n[02:17.450]你对一切都软弱与怠惰\n[02:20.960]让人怀疑你是否爱过我\n[02:26.207]真的爱过我\n[02:30.200]为你再也找不到借口\n[02:33.958]that’s why we should letting go\n[02:42.703]在夜深人静里想着\n[02:45.949]心不安却越沸腾\n[02:49.446]我无助 好想哭\n[02:53.453]我找不到退路\n[02:56.449]在夜深人静里写着\n[02:59.959]心慢慢就热变冷\n[03:03.950]我不恨 也不哭\n[03:07.201]我的眼泪早就哭干了\n[03:10.707]that's why I‘m letting go\n[03:13.952]我终于舍得为你放开手\n[03:17.947]因为爱你爱到我心痛\n[03:22.949]但你却不懂\n[03:25.452]I'm letting go\n[03:27.954]你对一切都软弱与怠惰\n[03:31.955]让人怀疑你是否爱过我\n[03:37.208]真的爱过我\n[03:40.702]为你再也找不到借口\n[03:44.197]that’s why we should letting go\n[04:03.597]编曲：王大夫\n[04:04.000]和声：樊竹青\n[04:04.597]母带：时俊峰\n[04:05.000]混音：欧姆\n[04:05.197]OP：TANGY MUSIC PUBLISHING (Warner Chappell Music, Hong Kong Limited Taiwan Branch)\n[04:10.197]SP：Warner Chappell Music Publishing Agency (Beijing) Ltd.\n"

            },
           

        ],
      }
    },
    methods: {
      playMusic(songName){
        this.songName = ''
        // 定义一个存放歌词数据对象的数组
        let songDataArray = []
        GetSong(songName).then(res => {
          console.log(res.result.songs);
          // 循环请求得到的歌曲数据
          res.result.songs.forEach( async (item,index,array) => {
            // 定义一个对象，用于存放具体数据
            let songData = {}
            // 获取歌名
            songData.title = item.name
            // 获取歌手名
            songData.artist = item.ar[0].name
            // 获取照片
            for(var key in  item.al){
              songData.pic = item.al.picUrl + '?param=100y100'
            }
            // 获取歌曲播放地址
            let musicUrl = await GetPlayMisicUrl(item.id)
            songData.url = musicUrl.data[0].url            
            // 获取歌词
            let MisicLyric = await GetPlayMisicLyric(item.id)
            if(MisicLyric.nolyric){
              songData.lrc = '[00:00.00] (,,•́ . •̀,,) 抱歉，当前歌曲暂无歌词'
            }else {
              songData.lrc = MisicLyric.lrc.lyric
            }
            //  完成此条数据的循环，将得到的歌曲数据push到数组
             songDataArray.push(songData)
    　　　  }
　　       );
        })
        // 将此次搜索得到的数据全部赋值给audio,等待播放
        this.audio = songDataArray
        
      }
    },
    components:{
      aplayer
    },
    mounted(){
      // 页面刷新添加一个自动点击事件
      let searchMusic = document.querySelector('#searchMusic');
        searchMusic.click();

      

    }
  }
</script>

<style lang="scss" scoped>
* {
	box-sizing:border-box;
}
// 音乐组件
.aplayer {
  margin: 0;
  margin-top: 15px;
  border-radius: 5px;
}
#container {
	width:500px;
	height:820px;
	margin:0 auto;
}
div.search {
	padding:10px 0;
  transform: translateY(20px);
}
div {
	position:relative;
	margin:0 auto;
}
input,button {
	border:none;
	outline:none;
}
input {
	width:100%;
	height:42px;
	padding-left:13px;
}
button {
	height:42px;
	width:42px;
	cursor:pointer;
	position:absolute;
}
/*搜索框7*/
      
.bar7 div {
	height:42px;
}
.bar7 input {
	width:250px;
	border-radius:42px;
	border:2px solid #324B4E;
	background:#F9F0DA;
	transition:.3s linear;
	float:right;
}
.bar7 input:focus {
	width:300px;
}
.bar7 button {
	background:none;
	top:-2px;
	right:20px;
}
.bar7 button:before {
	content:"Search";
	font-family:FontAwesome;
	color:#324b4e;
}
</style>